[
  {
    "Id": "1",
    "name": "Balsamic Glazed Steak with Roasted Vegetables",
    "Description": "Marinate the steak in balsamic vinegar, salt, and pepper. Roast the vegetables (bell peppers, broccoli, carrots, and cauliflower) in olive oil and garlic. Serve with mashed sweet potatoes.",
    "user_Id": "1"
  },
  {
    "Id": "2",
    "name": "Banana Bread French Toast",
    "Description": "Whisk together eggs, milk, and cinnamon. Dip slices of banana bread in the egg mixture and cook on a griddle until golden brown. Serve with sliced bananas and honey.",
    "user_Id": "1"
  },
  {
    "Id": "3",
    "name": "Spaghetti and Meatballs",
    "Description": "Mix together ground beef, bread crumbs, minced onions, garlic, salt, pepper, and an egg. Form into meatballs and bake until cooked through. Serve with spaghetti and canned tomato sauce.",
    "user_Id": "1"
  },
  {
    "Id": "4",
    "name": "Cheesy Broccoli Casserole",
    "Description": "Steam broccoli until tender. Mix together canned cream of mushroom soup, milk, shredded cheese, and bread crumbs. Layer the broccoli and cheese mixture in a casserole dish and bake until bubbly and golden brown.",
    "user_Id": "1"
  },
  {
    "Id": "5",
    "name": "Fish Tacos",
    "Description": "Coat fish fillets in flour, salt, and pepper. Pan-fry in olive oil until crispy. Serve in taco shells with sliced bell peppers, onions, and tomatoes. Drizzle with lime juice and hot sauce.",
    "user_Id": "1"
  },
  {
    "Id": "6",
    "name": "Roasted Carrot and Ginger Soup",
    "Description": "Roast carrots with olive oil, salt, and pepper until tender. Blend with ginger, chicken broth, and milk until smooth. Heat and serve with toasted bread.",
    "user_Id": "1"
  },
  {
    "Id": "7",
    "name": "Potato and Onion Frittata",
    "Description": "Whisk together eggs, salt, and pepper. Cook sliced potatoes and onions in olive oil until tender. Pour in the egg mixture and cook until set. Serve with a side salad.",
    "user_Id": "1"
  },
  {
    "Id": "8",
    "name": "Honey Garlic Chicken",
    "Description": "Mix together honey, minced garlic, soy sauce, and olive oil. Marinate chicken thighs in the mixture for at least an hour. Bake until cooked through and serve with roasted sweet potatoes.",
    "user_Id": "1"
  },
  {
    "Id": "9",
    "name": "Balsamic Glazed Salmon",
    "Description": "Mix together balsamic vinegar, honey, minced garlic, and olive oil. Brush the mixture over salmon fillets and bake until cooked through. Serve with roasted sweet potatoes and broccoli.",
    "user_Id": "1"
  },
  {
    "Id": "10",
    "name": "Broccoli and Cheddar Soup",
    "Description": "Cook broccoli in chicken broth until tender. Blend with milk, salt, and pepper until smooth. Add shredded cheddar cheese and heat until melted. Serve with toasted bread.",
    "user_Id": "1"
  },
  {
    "Id": "11",
    "name": "Banana Chocolate Chip Muffins",
    "Description": "Mix together mashed bananas, flour, sugar, an egg, melted butter, and chocolate chips. Spoon into muffin cups and bake until golden brown.",
    "user_Id": "1"
  },
  {
    "Id": "12",
    "name": "Chicken and Vegetable Stir Fry",
    "Description": "Stir-fry sliced chicken breast in olive oil with minced garlic and sliced onions. Add sliced bell peppers, carrots, celery, and broccoli and cook until tender. Season with soy sauce, ginger, and pepper. Serve over rice.",
    "user_Id": "1"
  },
  {
    "Id": "13",
    "name": "Spaghetti with Meat Sauce",
    "Description": "Brown ground beef in olive oil with minced garlic and sliced onions. Add canned tomatoes, salt, pepper, and sugar and simmer until thickened. Serve over spaghetti and top with grated cheese.",
    "user_Id": "1"
  },
  {
    "Id": "14",
    "name": "Garlic Roasted Potatoes",
    "Description": "Toss sliced potatoes with olive oil, minced garlic, salt, and pepper. Roast in the oven until golden brown and crispy.",
    "user_Id": "1"
  },
  {
    "Id": "15",
    "name": "Cauliflower and Cheese Casserole",
    "Description": "Steam cauliflower until tender. Mix together canned cream of mushroom soup, milk, shredded cheese, and bread crumbs. Layer the cauliflower and cheese mixture in a casserole dish and bake until bubbly and golden brown.",
    "user_Id": "1"
  },
  {
    "Id": "16",
    "name": "Honey Mustard Chicken Salad",
    "Description": "Season chicken breasts with salt and pepper and bake until cooked through. Slice and toss with mixed greens, sliced apples, and a homemade honey mustard dressing made with honey, dijon mustard, olive oil, and apple cider vinegar.",
    "user_Id": "1"
  },
  {
    "Id": "17",
    "name": "Broiled Steak with Garlic Butter",
    "Description": "Season steak with salt and pepper and broil until cooked to your desired level of doneness. Mix together softened butter and minced garlic and spread over the hot steak. Serve with roasted potatoes and carrots.",
    "user_Id": "1"
  },
  {
    "Id": "18",
    "name": "Sweet and Spicy Glazed Chicken",
    "Description": "Mix together honey, balsamic vinegar, minced garlic, and red pepper flakes. Brush the mixture over chicken thighs and bake until cooked through. Serve with roasted sweet potatoes and broccoli.",
    "user_Id": "1"
  },
  {
    "Id": "19",
    "name": "Garlic Parmesan Roasted Cauliflower",
    "Description": "Toss cauliflower florets with olive oil, minced garlic, salt, and pepper. Roast in the oven until tender and golden brown. Top with grated parmesan cheese before serving.",
    "user_Id": "1"
  },
  {
    "Id": "20",
    "name": "Cheesy Tomato and Broccoli Bake",
    "Description": "Cook broccoli until tender and layer in a baking dish with canned tomatoes, garlic, salt, and pepper. Top with shredded cheddar cheese and bread crumbs and bake until bubbly and golden brown.",
    "user_Id": "1"
  },
  {
    "Id": "21",
    "name": "Banana Oatmeal Pancakes",
    "Description": "Blend together rolled oats, mashed bananas, milk, an egg, and baking powder until smooth. Cook on a griddle until golden brown. Serve with sliced bananas and honey.",
    "user_Id": "1"
  },
  {
    "Id": "22",
    "name": "Garlic Shrimp Stir Fry",
    "Description": "Stir-fry shrimp in olive oil with minced garlic and sliced onions. Add sliced bell peppers, carrots, and celery and cook until tender. Season with soy sauce, ginger, and pepper. Serve over rice.",
    "user_Id": "1"
  },
  {
    "Id": "23",
    "name": "Spaghetti Carbonara",
    "Description": "Cook spaghetti in salted water until al dente. Whisk together eggs, grated parmesan cheese, salt, and pepper. Drain the spaghetti and toss with the egg mixture until the eggs are cooked through. Serve with toasted bread.",
    "user_Id": "1"
  },
  {
    "Id": "24",
    "name": "Honey Mustard Roasted Vegetables",
    "Description": "Toss chopped potatoes, carrots, cauliflower, and onions with olive oil, salt, and pepper. Roast in the oven until tender. Mix together honey, dijon mustard, and minced garlic and drizzle over the hot vegetables before serving.",
    "user_Id": "1"
  }
]